core/Standard/Compressible/system/blockMeshDict
/*--------------------------------*Thien Phan*-------------------------------*\


| =========                 |                                                 |


| \\      /  F ield         | OpenFOAM: phanquocthien.org                     |


|  \\    /   O peration     | Files are generated by Thien Phan               |


|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |


|    \\/     M anipulation  |         PhanQuocThien@gmail.com                 |


\*---------------------------------------------------------------------------*/


FoamFile

{

    version     2.0;

    format      ascii;

    class       dictionary;

    object      blockMeshDict;

}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters	1	;



geometry

{

}



vertices

(

	(	0	0	0	)	//	0

	(	1	0	0	)	//	1

	(	1	25	0	)	//	2

	(	-24	0	0	)	//	3

	(	0	0	0.01	)	//	4

	(	1	0	0.01	)	//	5

	(	1	25	0.01	)	//	6

	(	-24	0	0.01	)	//	7

	(	31	5	0	)	//	8

	(	31	25	0	)	//	9

	(	31	5	0.01	)	//	10

	(	31	25	0.01	)	//	11

	(	1	-25	0	)	//	12

	(	1	-25	0.01	)	//	13

	(	31	-25	0	)	//	14

	(	31	-25	0.01	)	//	15

	(	1	0	0	)	//	16

	(	1	0	0.01	)	//	17



);






blocks

(

	hex	(0	1	2	3	4	5	6	7)	(	150	100	1	)	//block 1
	edgeGrading

	(

	//	 x-direction	expansion	ratio

	(

(	0.250000000	0.333333333	1.500000000	)

(	0.750000000	0.666666667	1.333333333	)

	)

	0.020000000	0.020000000

	(

(	0.250000000	0.333333333	1.500000000	)

(	0.750000000	0.666666667	1.333333333	)

	)

	//	y-direction	expansion	ratio

	(

(	0.030000000	0.500000000	11.467399786	)

(	0.970000000	0.500000000	43.601863486	)

	)

	(

(	0.030000000	0.500000000	11.467399786	)

(	0.970000000	0.500000000	43.601863486	)

	)

	(

(	0.030000000	0.500000000	11.467399786	)

(	0.970000000	0.500000000	43.601863486	)

	)

	(

(	0.030000000	0.500000000	11.467399786	)

(	0.970000000	0.500000000	43.601863486	)

	)



	//	z-direction	expansion	ratio

	1	1	1	1

	)



	hex	(1	8	9	2	5	10	11	6)	(	200	100	1)	//block 2
	edgeGrading

	(

	//	x-direction	expansion	ratio

	200	200	200	200

	//	y-direction	expansion	ratio

	(

(	0.030000000	0.500000000	11.467399786	)

(	0.970000000	0.500000000	43.601863486	)

	)

	21.800931743	21.800931743

	(

(	0.030000000	0.500000000	11.467399786	)

(	0.970000000	0.500000000	43.601863486	)

	)



	//	z-direction	expansion	ratio

	1	1	1	1

	)



	hex	(3	12	16	0	7	13	17	4)	(	150	100	1	)	//block 3
	edgeGrading

	(

	//	x-direction	expansion	ratio

	0.020000000

	(

(	0.250000000	0.333333333	1.500000000	)

(	0.750000000	0.666666667	1.333333333	)

	)

	(

(	0.250000000	0.333333333	1.500000000	)

(	0.750000000	0.666666667	1.333333333	)

	)

	0.020000000

	//	y-direction	expansion	ratio

	(

(	0.970000000	0.500000000	0.022934800	)

(	0.030000000	0.500000000	0.087203727	)

	)

	(

(	0.970000000	0.500000000	0.022934800	)

(	0.030000000	0.500000000	0.087203727	)

	)

	(

(	0.970000000	0.500000000	0.022934800	)

(	0.030000000	0.500000000	0.087203727	)

	)

	(

(	0.970000000	0.500000000	0.022934800	)

(	0.030000000	0.500000000	0.087203727	)

	)



	//	z-direction	expansion	ratio

	1	1	1	1

	)











	hex	(12	14	8	16	13	15	10	17)	(	200	100	1)	//block 4
	edgeGrading

	(

	//	x-direction	expansion	ratio

	200	200	200	200

	//	y-direction	expansion	ratio

	(

(	0.970000000	0.500000000	0.022934800	)

(	0.030000000	0.500000000	0.087203727	)

	)

	0.045869599	0.045869599

	(

(	0.970000000	0.500000000	0.022934800	)

(	0.030000000	0.500000000	0.087203727	)

	)

	//	z-direction	expansion	ratio

	1	1	1	1

	)

);





edges

(

	arc	3 2	(	-16.677669530	17.677669530	0	)

	arc	7 6	(	-16.677669530	17.677669530	0.010000000	)



	spline	1	0

	(

	(	0.868511	0.018327	0	)

	(	0.754312	0.031153	0	)

	(	0.655129	0.040861	0	)

	(	0.568987	0.048099	0	)

	(	0.494171	0.053304	0	)

	(	0.429193	0.056817	0	)

	(	0.372759	0.058928	0	)

	(	0.323746	0.059892	0	)

	(	0.281177	0.059936	0	)

	(	0.244205	0.059257	0	)

	(	0.212095	0.058020	0	)

	(	0.184207	0.056368	0	)

	(	0.159986	0.054417	0	)

	(	0.138950	0.052261	0	)

	(	0.120679	0.049975	0	)

	(	0.104811	0.047620	0	)

	(	0.091030	0.045241	0	)

	(	0.079060	0.042875	0	)

	(	0.068665	0.040548	0	)

	(	0.059636	0.038279	0	)

	(	0.051795	0.036084	0	)

	(	0.044984	0.033970	0	)

	(	0.039069	0.031945	0	)

	(	0.033932	0.030013	0	)

	(	0.029471	0.028174	0	)

	(	0.025595	0.026429	0	)

	(	0.022230	0.024777	0	)

	(	0.019307	0.023215	0	)

	(	0.016768	0.021742	0	)

	(	0.014563	0.020353	0	)

	(	0.012649	0.019045	0	)

	(	0.010985	0.017815	0	)

	(	0.009541	0.016660	0	)

	(	0.008286	0.015575	0	)

	(	0.007197	0.014557	0	)

	(	0.006251	0.013603	0	)

	(	0.005429	0.012709	0	)

	(	0.004715	0.011871	0	)

	(	0.004095	0.011086	0	)

	(	0.003556	0.010352	0	)

	(	0.003089	0.009665	0	)

	(	0.002683	0.009022	0	)

	(	0.002330	0.008421	0	)

	(	0.002024	0.007860	0	)

	(	0.001758	0.007335	0	)

	(	0.001526	0.006844	0	)

	(	0.001326	0.006386	0	)

	(	0.001151	0.005957	0	)

	(	0.001000	0.005557	0	)

	)






	spline	5	4

	(

	(	0.868511	0.018327	0.010000	)

	(	0.754312	0.031153	0.010000	)

	(	0.655129	0.040861	0.010000	)

	(	0.568987	0.048099	0.010000	)

	(	0.494171	0.053304	0.010000	)

	(	0.429193	0.056817	0.010000	)

	(	0.372759	0.058928	0.010000	)

	(	0.323746	0.059892	0.010000	)

	(	0.281177	0.059936	0.010000	)

	(	0.244205	0.059257	0.010000	)

	(	0.212095	0.058020	0.010000	)

	(	0.184207	0.056368	0.010000	)

	(	0.159986	0.054417	0.010000	)

	(	0.138950	0.052261	0.010000	)

	(	0.120679	0.049975	0.010000	)

	(	0.104811	0.047620	0.010000	)

	(	0.091030	0.045241	0.010000	)

	(	0.079060	0.042875	0.010000	)

	(	0.068665	0.040548	0.010000	)

	(	0.059636	0.038279	0.010000	)

	(	0.051795	0.036084	0.010000	)

	(	0.044984	0.033970	0.010000	)

	(	0.039069	0.031945	0.010000	)

	(	0.033932	0.030013	0.010000	)

	(	0.029471	0.028174	0.010000	)

	(	0.025595	0.026429	0.010000	)

	(	0.022230	0.024777	0.010000	)

	(	0.019307	0.023215	0.010000	)

	(	0.016768	0.021742	0.010000	)

	(	0.014563	0.020353	0.010000	)

	(	0.012649	0.019045	0.010000	)

	(	0.010985	0.017815	0.010000	)

	(	0.009541	0.016660	0.010000	)

	(	0.008286	0.015575	0.010000	)

	(	0.007197	0.014557	0.010000	)

	(	0.006251	0.013603	0.010000	)

	(	0.005429	0.012709	0.010000	)

	(	0.004715	0.011871	0.010000	)

	(	0.004095	0.011086	0.010000	)

	(	0.003556	0.010352	0.010000	)

	(	0.003089	0.009665	0.010000	)

	(	0.002683	0.009022	0.010000	)

	(	0.002330	0.008421	0.010000	)

	(	0.002024	0.007860	0.010000	)

	(	0.001758	0.007335	0.010000	)

	(	0.001526	0.006844	0.010000	)

	(	0.001326	0.006386	0.010000	)

	(	0.001151	0.005957	0.010000	)

	(	0.001000	0.005557	0.010000	)

	)






	arc	3 12	(	-16.677669530	 -17.677669530	 0.000000000	)

	arc	7 13	(	-16.677669530	-17.677669530	0.010000000	)



	spline	0	16

	(

	(	0.001151	-0.005957	0.000000	)

	(	0.001326	-0.006386	0.000000	)

	(	0.001526	-0.006844	0.000000	)

	(	0.001758	-0.007335	0.000000	)

	(	0.002024	-0.007860	0.000000	)

	(	0.002330	-0.008421	0.000000	)

	(	0.002683	-0.009022	0.000000	)

	(	0.003089	-0.009665	0.000000	)

	(	0.003556	-0.010352	0.000000	)

	(	0.004095	-0.011086	0.000000	)

	(	0.004715	-0.011871	0.000000	)

	(	0.005429	-0.012709	0.000000	)

	(	0.006251	-0.013603	0.000000	)

	(	0.007197	-0.014557	0.000000	)

	(	0.008286	-0.015575	0.000000	)

	(	0.009541	-0.016660	0.000000	)

	(	0.010985	-0.017815	0.000000	)

	(	0.012649	-0.019045	0.000000	)

	(	0.014563	-0.020353	0.000000	)

	(	0.016768	-0.021742	0.000000	)

	(	0.019307	-0.023215	0.000000	)

	(	0.022230	-0.024777	0.000000	)

	(	0.025595	-0.026429	0.000000	)

	(	0.029471	-0.028174	0.000000	)

	(	0.033932	-0.030013	0.000000	)

	(	0.039069	-0.031945	0.000000	)

	(	0.044984	-0.033970	0.000000	)

	(	0.051795	-0.036084	0.000000	)

	(	0.059636	-0.038279	0.000000	)

	(	0.068665	-0.040548	0.000000	)

	(	0.079060	-0.042875	0.000000	)

	(	0.091030	-0.045241	0.000000	)

	(	0.104811	-0.047620	0.000000	)

	(	0.120679	-0.049975	0.000000	)

	(	0.138950	-0.052261	0.000000	)

	(	0.159986	-0.054417	0.000000	)

	(	0.184207	-0.056368	0.000000	)

	(	0.212095	-0.058020	0.000000	)

	(	0.244205	-0.059257	0.000000	)

	(	0.281177	-0.059936	0.000000	)

	(	0.323746	-0.059892	0.000000	)

	(	0.372759	-0.058928	0.000000	)

	(	0.429193	-0.056817	0.000000	)

	(	0.494171	-0.053304	0.000000	)

	(	0.568987	-0.048099	0.000000	)

	(	0.655129	-0.040861	0.000000	)

	(	0.754312	-0.031153	0.000000	)

	(	0.868511	-0.018327	0.000000	)

	(	1.000000	-0.001260	0.000000	)

)





	spline	4	17

	(

	(	0.001151000	-0.005957000	0.010000000	)

	(	0.001326000	-0.006386000	0.010000000	)

	(	0.001526000	-0.006844000	0.010000000	)

	(	0.001758000	-0.007335000	0.010000000	)

	(	0.002024000	-0.007860000	0.010000000	)

	(	0.002330000	-0.008421000	0.010000000	)

	(	0.002683000	-0.009022000	0.010000000	)

	(	0.003089000	-0.009665000	0.010000000	)

	(	0.003556000	-0.010352000	0.010000000	)

	(	0.004095000	-0.011086000	0.010000000	)

	(	0.004715000	-0.011871000	0.010000000	)

	(	0.005429000	-0.012709000	0.010000000	)

	(	0.006251000	-0.013603000	0.010000000	)

	(	0.007197000	-0.014557000	0.010000000	)

	(	0.008286000	-0.015575000	0.010000000	)

	(	0.009541000	-0.016660000	0.010000000	)

	(	0.010985000	-0.017815000	0.010000000	)

	(	0.012649000	-0.019045000	0.010000000	)

	(	0.014563000	-0.020353000	0.010000000	)

	(	0.016768000	-0.021742000	0.010000000	)

	(	0.019307000	-0.023215000	0.010000000	)

	(	0.022230000	-0.024777000	0.010000000	)

	(	0.025595000	-0.026429000	0.010000000	)

	(	0.029471000	-0.028174000	0.010000000	)

	(	0.033932000	-0.030013000	0.010000000	)

	(	0.039069000	-0.031945000	0.010000000	)

	(	0.044984000	-0.033970000	0.010000000	)

	(	0.051795000	-0.036084000	0.010000000	)

	(	0.059636000	-0.038279000	0.010000000	)

	(	0.068665000	-0.040548000	0.010000000	)

	(	0.079060000	-0.042875000	0.010000000	)

	(	0.091030000	-0.045241000	0.010000000	)

	(	0.104811000	-0.047620000	0.010000000	)

	(	0.120679000	-0.049975000	0.010000000	)

	(	0.138950000	-0.052261000	0.010000000	)

	(	0.159986000	-0.054417000	0.010000000	)

	(	0.184207000	-0.056368000	0.010000000	)

	(	0.212095000	-0.058020000	0.010000000	)

	(	0.244205000	-0.059257000	0.010000000	)

	(	0.281177000	-0.059936000	0.010000000	)

	(	0.323746000	-0.059892000	0.010000000	)

	(	0.372759000	-0.058928000	0.010000000	)

	(	0.429193000	-0.056817000	0.010000000	)

	(	0.494171000	-0.053304000	0.010000000	)

	(	0.568987000	-0.048099000	0.010000000	)

	(	0.655129000	-0.040861000	0.010000000	)

	(	0.754312000	-0.031153000	0.010000000	)

	(	0.868511000	-0.018327000	0.010000000	)

	(	1.000000000	-0.001260000	0.010000000	)

)






);




faces

(



);



faces

(



);





defaultPatch

{

	name frontAndBack;

	type empty;

}



boundary

(

inlet		// patch name

	{

			type patch;

		faces

		(

			(9 2 6 11)

			(2 3 7 6)

			(3 12 13 7)

			(12 15 14 13)

		);

	}



outlet		// patch name

	{

		type patch;

		faces

		(

			(8 9 10 11)

			(15 8 10 14)

		);

	}


walls		// patch name

	{

		type wall;

		faces

		(

			(0 1 5 4)

			(0 4 17 16)

		);

		}


interface1		// patch name	

	{

		type patch;

			faces

		(
			(1 8 10 5)

		);

	}

interface2		// patch name

		{

		type patch;

			faces

		(

			(16 17 10 8)

		);

	}

);


mergePatchPairs

(

	(interface1 interface2)

);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

